{
  "ide.selection": "¿Qué IDE estás usando?",
  "ide.customFolder": "Nombre de la carpeta de configuración (o deja en blanco para usar .ai):",
  "project.name": "¿Cuál es el nombre del proyecto?",
  "project.description": "Describe el problema que este proyecto resuelve:",
  "project.problemImportance": "¿Por qué importa este problema?",
  "project.targetUsers": "¿Quiénes son los usuarios principales de este proyecto?",
  "project.businessGoals": "¿Cuáles son los objetivos de negocio principales?",
  "project.technicalConstraints": "¿Cuáles son las restricciones técnicas? (o \"Ninguna\" si no hay)",
  "project.businessConstraints": "¿Cuáles son las restricciones de negocio? (o \"Ninguna\" si no hay)",
  "project.nonGoals": "¿Qué NO hace este proyecto? (lo que está fuera del alcance)",
  "project.version": "¿Cuál es la versión inicial del proyecto?",
  "tech.language": "¿Cuál es el lenguaje principal del proyecto?",
  "tech.framework": "¿Qué framework estás usando?",
  "tech.database": "¿Qué base de datos estás usando?",
  "preferences.useTDD": "¿Usas TDD (Test-Driven Development)?",
  "preferences.strictMode": "¿Prefieres modo strict en TypeScript?",
  "advanced.confirm": "\n🔧 ¿Deseas configurar opciones avanzadas? (permitirá personalizar todos los archivos)",
  "advanced.groupSelection": "\n📋 Selecciona un grupo de configuración avanzada para completar:",
  "advanced.finish": "✅ Finalizar configuración avanzada",
  "ai.preferredModelArchitecture": "¿Qué modelo de IA prefieres para Arquitectura y Planificación?",
  "ai.preferredModelImplementation": "¿Qué modelo de IA prefieres para Implementación de Código?",
  "ai.preferredModelRefactoring": "¿Qué modelo de IA prefieres para Refactorización y Legado?",
  "ai.preferredModelDebug": "¿Qué modelo de IA prefieres para Depuración y Análisis?",
  "ai.preferredModelBoilerplate": "¿Qué modelo de IA prefieres para Código Rápido / Boilerplate?",
  "ai.allowArchitecturePlanning": "¿Permitir uso de IA para Arquitectura y Planificación?",
  "ai.allowCodeGeneration": "¿Permitir uso de IA para Generación de Código?",
  "ai.allowRefactoring": "¿Permitir uso de IA para Refactorización?",
  "ai.allowDebug": "¿Permitir uso de IA para Depuración y Análisis?",
  "ai.allowDocumentation": "¿Permitir uso de IA para Documentación?",
  "ai.customConstraints": "Restricciones personalizadas para uso de IA (o deja en blanco):",
  "responsibilities.cto": "Responsabilidad del CTO respecto al uso de IA:",
  "responsibilities.techLead": "Responsabilidad del Tech Lead respecto al uso de IA:",
  "responsibilities.dev": "Responsabilidad del Dev respecto al uso de IA:",
  "libraries.allowed": "Bibliotecas permitidas adicionales (separadas por comas, o deja en blanco):",
  "libraries.forbidden": "Bibliotecas prohibidas adicionales (separadas por comas, o deja en blanco):",
  "libraries.notes": "Notas sobre política de bibliotecas (o deja en blanco):",
  "architecture.style": "Estilo arquitectónico del proyecto (ej.: Monolito, Microservicios, Serverless):",
  "architecture.decisions": "Decisiones arquitectónicas principales (separadas por comas, o deja en blanco):",
  "architecture.patterns": "Patrones de diseño utilizados (separados por comas, o deja en blanco):",
  "security.authentication": "Método de autenticación utilizado (o deja en blanco):",
  "security.dataProtection": "Medidas de protección de datos (o deja en blanco):",
  "security.rules": "Reglas de seguridad específicas (separadas por comas, o deja en blanco):",
  "testing.strategy": "Estrategia de pruebas (o deja en blanco para usar predeterminado):",
  "testing.coverage": "Cobertura de pruebas mínima esperada (ej.: 80%, o deja en blanco):",
  "testing.tools": "Herramientas de prueba utilizadas (separadas por comas, o deja en blanco):",
  "deployment.method": "Método de despliegue (ej.: Docker, Vercel, AWS, o deja en blanco):",
  "deployment.infrastructure": "Infraestructura utilizada (o deja en blanco):",
  "deployment.cicd": "Herramienta de CI/CD (ej.: GitHub Actions, GitLab CI, o deja en blanco):",
  "deployment.environments": "Entornos disponibles (ej.: dev, staging, prod, o deja en blanco):",
  "documentation.standards": "Estándares de documentación (o deja en blanco):",
  "documentation.api": "Herramienta de documentación de API (ej.: Swagger, o deja en blanco):",
  "documentation.comments": "Patrón de comentarios en el código (o deja en blanco):",
  "language.selection": "Selecciona el idioma de las preguntas:",
  "language.files": "Selecciona el idioma de los archivos generados:"
}

